### Data cleaning \ pre-processing

#### Import Neccessary libraries

In [17]:
import pandas as pd
import numpy as np

#### Load and clean the 'client profile' dataset

In [4]:
demog = pd.read_csv("df_final_demo.csv")
demog.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [5]:
demog.tail()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [6]:
demog.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70609 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70594 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [11]:
demog.duplicated().sum()

0

In [7]:
demog.isnull().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

First let's precise or approximate the age column and handle the null values in each column acccordingly then change the float datatype into integer. Since the null datapoints are very less comparatively to the whole dataset it is a good idea to drop them once.

In [18]:
demog['clnt_age'] = demog['clnt_age'].apply(lambda x: round(x,0))

In [22]:
demog.dropna(inplace = True)

In [23]:
# Let's check our dataset for null value
demog.isnull().sum()

client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
dtype: int64

In [24]:
demog[['clnt_tenure_yr', 'clnt_tenure_mnth','clnt_age','num_accts','bal','calls_6_mnth','logons_6_mnth']] = demog[['clnt_tenure_yr', 'clnt_tenure_mnth','clnt_age','num_accts','bal','calls_6_mnth','logons_6_mnth']].astype(int)

Now let us check our dataset entirely and save it as csv file for EDA.

In [25]:
demog.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6,73,60,U,2,45105,6,9
1,2304905,7,94,58,U,2,110860,6,9
2,1439522,5,64,32,U,2,52467,6,9
3,1562045,16,198,49,M,2,67454,3,6
4,5126305,12,145,33,F,2,103671,0,3

In [27]:
demog.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70594 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70594 non-null  int64
 1   clnt_tenure_yr    70594 non-null  int32
 2   clnt_tenure_mnth  70594 non-null  int32
 3   clnt_age          70594 non-null  int32
 4   gendr             70594 non-null  object
 5   num_accts         70594 non-null  int32
 6   bal               70594 non-null  int32
 7   calls_6_mnth      70594 non-null  int32
 8   logons_6_mnth     70594 non-null  int32
dtypes: int32(7), int64(1), object(1)
memory usage: 3.5+ MB

In [28]:
# Save the clean data to csv format
demog.to_csv('demog.csv')

#### Load and clean the 'df_final_web_data' dataset

In [86]:
pt_1 = pd.read_csv("df_final_web_data_pt_1.csv")
pt_2 = pd.read_csv("df_final_web_data_pt_2.csv")

Here first we add the datasets together then we check the data if it has a null value, duplicates, and if the datatypes are appropriate or not.

In [93]:
web_data = pd.concat([pt_1, pt_2], axis=0)
web_data.shape

(755405, 5)

In [97]:
web_data.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [95]:
web_data.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [96]:
web_data.duplicated().sum()

10764

In [99]:
# Handle the duplicated data points by keeping the first row and deleting the rest/duplicate
web_data.drop_duplicates(inplace = True)

In [100]:
# Check the dataset if duplicates are removed
web_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 744641 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     744641 non-null  int64
 1   visitor_id    744641 non-null  object
 2   visit_id      744641 non-null  object
 3   process_step  744641 non-null  object
 4   date_time     744641 non-null  object
dtypes: int64(1), object(4)
memory usage: 34.1+ MB

In [101]:
# Check the frequency of the variable 'process_step' catagories
web_data['process_step'].value_counts()

start      234999
step_1     162797
step_2     132750
step_3     111589
confirm    102506
Name: process_step, dtype: int64

Now let's split the date_time column in to two /Date and Time/.

In [102]:
# Change the datetime object datatype to datatime and change the format
web_data['date_time'] = pd.to_datetime(web_data['date_time'])

In [108]:
web_data.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [122]:
# Add a column named "date, time, year, month, day" extracted from date_time column
web_data['date'] = web_data['date_time'].apply(lambda x: x.strftime('%Y, %b, %d'))
web_data['time'] = web_data['date_time'].apply(lambda x: x.strftime('%H, %M, %S'))
web_data['year'] = web_data['date_time'].dt.year
web_data['month'] = web_data['date_time'].dt.month
web_data['day'] = web_data['date_time'].dt.day

In [136]:
# reset the index
web_data = web_data.reset_index()
web_data.head(2)

In [142]:
# drop index, Date and date_time column and arrange the columns
web_data = web_data.drop(['index', 'date_time', 'Date'], axis = 1)
web_data.head()

In [145]:
web_data.tail()

,client_id,visitor_id,visit_id,process_step,time,date,year,month,day
744636,9668240,388766751_9038881013,922267647_3096648104_968866,start,"18, 46, 10","2017, May, 24",2017,5,24
744637,9668240,388766751_9038881013,922267647_3096648104_968866,start,"18, 45, 29","2017, May, 24",2017,5,24
744638,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,"18, 44, 51","2017, May, 24",2017,5,24
744639,9668240,388766751_9038881013,922267647_3096648104_968866,start,"18, 44, 34","2017, May, 24",2017,5,24
744640,674799,947159805_81558194550,86152093_47511127657_716022,start,"12, 17, 09","2017, Jun, 03",2017,6,3

In [146]:
web_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744641 entries, 0 to 744640
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     744641 non-null  int64
 1   visitor_id    744641 non-null  object
 2   visit_id      744641 non-null  object
 3   process_step  744641 non-null  object
 4   time          744641 non-null  object
 5   date          744641 non-null  object
 6   year          744641 non-null  int64
 7   month         744641 non-null  int64
 8   day           744641 non-null  int64
dtypes: int64(4), object(5)
memory usage: 51.1+ MB

Now our dataframe is clean and preprocessed so, let us save it for EDA.

In [147]:
web_data.to_csv('web_data.csv')

#### Load and clean the 'df_final_experiment_clients' dataset

In [149]:
final_ex = pd.read_csv('df_final_experiment_clients.csv')
final_ex.shape

(70609, 2)

Let us see our data if needs to be pre-processed or not in the aspect of column names, duplicates, null value, data type, or other issues if there is.

In [150]:
final_ex.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [151]:
final_ex.tail()

       client_id Variation
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

In [152]:
# Let us see how many null values are there
final_ex.isnull().sum()

client_id        0
Variation    20109
dtype: int64

In this case, we just have to drop the rows that have a null value because; a NULL variation means those associated client_id customers were not considered to be in the final experiment, or their data were not registered.

In [153]:
final_ex.dropna(inplace = True)

In [159]:
final_ex.isnull().sum()

client_id    0
Variation    0
dtype: int64

In [155]:
final_ex.shape

(50500, 2)

In [156]:
# Check for duplicates
final_ex.duplicated().sum()

0

In [157]:
final_ex.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50500 entries, 0 to 50499
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  50500 non-null  int64
 1   Variation  50500 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.2+ MB

In [162]:
# Change all column name to small letter
final_ex.columns = ['client_id','variation']

In [164]:
final_ex.head()

   client_id variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

Now the dataset is cleaned so, let us save it to csv for EDA.

In [165]:
final_ex.to_csv("final_ex.csv")